app/controllers/campaigns_controller.rb

  def show
    @campaign = @user.campaigns.find(params[:id])
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 1 AND ("campaigns".user_id = 9))

  def create
    @campaign = Campaign.new(params[:campaign])
    @campaign.user = current_user

    respond_to do |format|
      if @campaign.save
---
INSERT INTO "campaigns" ("campaign_type", "size", "created_at", "title", "updated_at", "user_id", "copy1", "copy2", "status") VALUES(NULL, E'Small(~50 repsonses)', '2009-06-07 18:57:12.483828', E'See ua ,rds kdame', '2009-06-07 18:57:12.483828', 9, E'Matthew the workalsho', E'newsradio is teh rox0r', E'pending') RETURNING "id"

  def destroy
    redirect_to root_path unless @campaign.user == @user
    @campaign.destroy
---
DELETE FROM "campaigns" WHERE "id" = 1