app/controllers/companies_controller.rb

SELECT * FROM "companies"
---
  def index
    @companies = Company.all

SELECT * FROM "companies" WHERE ("companies"."id" = 1)
---
  def show
    @company = Company.find(params[:id])