app/controllers/users_controller.rb

SELECT * FROM "users" ORDER BY created_at ASC
---
  def index
    @users = User.all

SELECT * FROM "users" WHERE ("users"."id" = 5) ORDER BY created_at ASC
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("address1", "city", "single_access_token", "last_request_at", "created_at", "address2", "zip", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_name", "last_login_ip", "login", "last_login_at", "email", "first_name", "state") VALUES(NULL, NULL, E'c-eF9-AuquCqk8u-PRuy', '2009-06-07 21:06:56.224643', '2009-06-07 21:06:56.226147', NULL, NULL, E'7ae1fd3d82bfbb41d7b580a0bb11278cc5fd9069800dfde845f02e6323bc408d92b74931c609f06366e99b8d7b96cb849f5ec16cc09c6d335b437d889638a8ab', E'rhc56-wh8-0AD7YpNsuI', '2009-06-07 21:06:56.226147', 0, E'71.239.208.44', E'ym_2OdmjG8TfsdO7T_69', '2009-06-07 21:06:56.224183', E'0eb9283c3cd53832ab493beb9020cfbd0fb1b9613bd4037f5de1ee65f668b9340ce093e7de1f536b803c0d610bce500b66b4c7b601ef7e61bc3a7c81568a17f6', 1, NULL, NULL, NULL, NULL, E'zackster@gmail.com', NULL, NULL) RETURNING "id"
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

UPDATE "users" SET "updated_at" = '2009-06-07 12:26:33.831701', "perishable_token" = E'Q_Tg0z8fb4UwAGB3X3iG', "last_request_at" = '2009-06-07 12:26:33.830087' WHERE "id" = 9
---
  def update
    @user = current_user

    # Is this the user's first time updating their profile? If so, let's direct them to the employee management page
    # Tried checking if new by created_at == updated_at, but current_user under authlogic updates the entry :P
    # Bastard. So now we have a lame check that if the name was empty, we assume it's their first run
    logger.info("User.full_name: #{@user.full_name}, param: #{params[:user][:full_name]}")
    initial_run = true if @user.full_name.nil? and params[:user][:full_name] != nil

    respond_to do |format|
      if @user.update_attributes(params[:user])